app/controllers/v1/contacts_controller.rb

  def index
    contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"