app/controllers/v1/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
  def index
    experiences = Experience.all