app/controllers/v1/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    projects = Project.all