app/controllers/v1/skills_controller.rb

SELECT "skills".* FROM "skills"
---
  def index
    skills = Skill.all

INSERT INTO "skills" ("imgUrl", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["imgUrl", "https://cdn4.iconfinder.com/data/icons/logos-3/600/React.js_logo-512.png"], ["created_at", "2019-05-12 15:16:57.224838"], ["updated_at", "2019-05-12 15:16:57.224838"]]
---
  def create
    skill = Skill.new(skill_params)

    if skill.save