app/controllers/v1/sliders_controller.rb

  def index
    sliders = Slider.all
---
SELECT "sliders".* FROM "sliders"

  def create
    slider = Slider.new(slider_params)

    if slider.save
---
INSERT INTO "sliders" ("title", "subTitle", "skillList", "sideImgDesktop", "avatarCenterMobile", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"