app/controllers/v1/socials_controller.rb

  def index
    socials = Social.all
---
SELECT "socials".* FROM "socials"

  def create
    social = Social.new(social_params)

    if social.save
---
INSERT INTO "socials" ("linkedin", "twitter", "github", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["linkedin", "linkedin"], ["twitter", "twitter"], ["github", "github"], ["created_at", "2019-05-07 08:13:08.145518"], ["updated_at", "2019-05-07 08:13:08.145518"]]

  def show
    social = Social.find(params[:id])
---
SELECT  "socials".* FROM "socials" WHERE "socials"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    social = Social.find(params[:id])
    if social.update(social_params)
---
SELECT  "socials".* FROM "socials" WHERE "socials"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "socials" SET "linkedin" = $1, "twitter" = $2, "github" = $3, "updated_at" = $4 WHERE "socials"."id" = $5  [["linkedin", "linkedin2"], ["twitter", "twitter2"], ["github", "github2"], ["updated_at", "2019-05-07 08:24:51.677937"], ["id", 2]]

  def destroy
    social = Social.find(params[:id])
    social.destroy
---
SELECT  "socials".* FROM "socials" WHERE "socials"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "socials" WHERE "socials"."id" = $1  [["id", 2]]