app/controllers/v1/testimonials_controller.rb

SELECT "testimonials".* FROM "testimonials"
---
  def index
    testimonials = Testimonial.all